
## :x: Apply Failed

[CI link](https://github.com/hayas1/tfgh/actions/runs/11800075560)



<pre><code>Error: POST https://api.github.com/repos/hayas1/dyson-rs/git/refs: 422 Reference already exists []

  with module.repositories[&#34;dyson-rs&#34;].github_repository_file.this[&#34;github/labeler.yml&#34;],
  on module/repository/files.tf line 12, in resource &#34;github_repository_file&#34; &#34;this&#34;:
  12: resource &#34;github_repository_file&#34; &#34;this&#34; {


Error: POST https://api.github.com/repos/hayas1/dyson-rs/git/refs: 422 Reference already exists []

  with module.repositories[&#34;dyson-rs&#34;].github_repository_file.this[&#34;github/workflows/labeler.yml&#34;],
  on module/repository/files.tf line 12, in resource &#34;github_repository_file&#34; &#34;this&#34;:
  12: resource &#34;github_repository_file&#34; &#34;this&#34; {

::error::Terraform exited with code 1.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
module.repositories["tfgh"].github_repository.this: Refreshing state... [id=tfgh]
module.repositories["dyson-rs"].github_repository.this: Refreshing state... [id=dyson-rs]
module.repositories["tfgh"].github_repository_ruleset.this: Refreshing state... [id=2558597]
module.repositories["dyson-rs"].github_branch.default: Refreshing state... [id=dyson-rs:master]
module.repositories["tfgh"].github_branch.default: Refreshing state... [id=tfgh:main]
module.repositories["tfgh"].github_issue_label.this["breaking"]: Refreshing state... [id=tfgh:breaking]
module.repositories["tfgh"].github_issue_label.this["documentation"]: Refreshing state... [id=tfgh:documentation]
module.repositories["tfgh"].github_issue_label.this["feature"]: Refreshing state... [id=tfgh:feature]
module.repositories["tfgh"].github_issue_label.this["bugfix"]: Refreshing state... [id=tfgh:bugfix]
module.repositories["tfgh"].github_issue_label.this["refactor"]: Refreshing state... [id=tfgh:refactor]
module.repositories["tfgh"].github_issue_label.this["deps"]: Refreshing state... [id=tfgh:deps]
module.repositories["tfgh"].github_issue_label.this["maintenance"]: Refreshing state... [id=tfgh:maintenance]
module.repositories["tfgh"].github_branch_default.this: Refreshing state... [id=tfgh]
module.repositories["dyson-rs"].github_branch_default.this: Refreshing state... [id=dyson-rs]
module.repositories["tfgh"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=tfgh/.github/pull_request_template.md]
module.repositories["tfgh"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=tfgh/.github/labeler.yml]
module.repositories["tfgh"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=tfgh/.github/workflows/labeler.yml]
module.repositories["tfgh"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=tfgh/.github/release.yml]
module.repositories["tfgh"].github_repository_pull_request.managed: Refreshing state... [id=hayas1:tfgh:56]
github_issue_label.manual: Refreshing state... [id=tfgh:manual]
github_repository_environment.apply: Refreshing state... [id=tfgh:apply]
github_issue_label.update-snippets: Refreshing state... [id=tfgh:update-snippets]
github_repository_environment.plan: Refreshing state... [id=tfgh:plan]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.repositories["dyson-rs"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"fda4b7d175b7a8955028985ae89cf7c3a10b7411c0c90a1ba8953ea1c1128a9f\"" -> "W/\"8aa89d575b03d7b7e960309c5d257e514df472206f79a1007ff31220a51b6be2\""
        id                          = "dyson-rs"
        name                        = "dyson-rs"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repositories["tfgh"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"5e28d2741b877ed39e526ac115ae612ce2da8cac39e36f1e28c19a9cd3c1ee73\"" -> "W/\"593c5a001792cf1f30e73b5ef891f4e440537a697e1f70e41eaabe0015fb99f9\""
        id                          = "tfgh"
        name                        = "tfgh"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.repositories["dyson-rs"].github_issue_label.this["breaking"] will be created
  + resource "github_issue_label" "this" {
      + color       = "F84AD4"
      + description = "Containing breaking changes"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "breaking"
      + repository  = "dyson-rs"
      + url         = (known after apply)
    }

  # module.repositories["dyson-rs"].github_issue_label.this["bugfix"] will be created
  + resource "github_issue_label" "this" {
      + color       = "DE3659"
      + description = "Fix some bugs"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "bugfix"
      + repository  = "dyson-rs"
      + url         = (known after apply)
    }

  # module.repositories["dyson-rs"].github_issue_label.this["deps"] will be created
  + resource "github_issue_label" "this" {
      + color       = "36BF46"
      + description = "Dependency updates"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "deps"
      + repository  = "dyson-rs"
      + url         = (known after apply)
    }

  # module.repositories["dyson-rs"].github_issue_label.this["documentation"] will be created
  + resource "github_issue_label" "this" {
      + color       = "0075CA"
      + description = "Documentation"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "documentation"
      + repository  = "dyson-rs"
      + url         = (known after apply)
    }

  # module.repositories["dyson-rs"].github_issue_label.this["feature"] will be created
  + resource "github_issue_label" "this" {
      + color       = "008B75"
      + description = "New feature"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "feature"
      + repository  = "dyson-rs"
      + url         = (known after apply)
    }

  # module.repositories["dyson-rs"].github_issue_label.this["maintenance"] will be created
  + resource "github_issue_label" "this" {
      + color       = "7F6054"
      + description = "No effect on codebase"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "maintenance"
      + repository  = "dyson-rs"
      + url         = (known after apply)
    }

  # module.repositories["dyson-rs"].github_issue_label.this["refactor"] will be created
  + resource "github_issue_label" "this" {
      + color       = "BA5798"
      + description = "Refactoring"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "refactor"
      + repository  = "dyson-rs"
      + url         = (known after apply)
    }

  # module.repositories["dyson-rs"].github_repository.this will be updated in-place
  ~ resource "github_repository" "this" {
      ~ delete_branch_on_merge      = false -> true
      - has_downloads               = true -> null
      - has_issues                  = true -> null
      - has_projects                = true -> null
      - has_wiki                    = true -> null
        id                          = "dyson-rs"
        name                        = "dyson-rs"
        # (31 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repositories["dyson-rs"].github_repository_file.this["github/labeler.yml"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "master"
      + autocreate_branch_source_sha    = (known after apply)
      + branch                          = "chore/managed-by-terraform"
      + commit_message                  = "Managed by Terraform: .github/labeler.yml"
      + commit_sha                      = (known after apply)
      + content                         = <<-EOT
            feature:
              - head-branch:
                - '^feat/'
                - '^feature/'
            
            breaking:
              - head-branch:
                - '^breaking/'
            
            bugfix:
              - head-branch:
                - '^fix/'
                - '^bugfix/'
                - '^modify/'
            
            refactor:
              - head-branch:
                - '^refactor/'
            
            documentation:
              - changed-files:
                - any-glob-to-any-file:
                  - '**/README.md'
              - head-branch:
                - '^doc/'
                - '^docs/'
                - '^documentation/'
            
            deps:
              - head-branch:
                - '^dep/'
                - '^deps/'
                - '^dependencies/'
            
            maintenance:
              - changed-files:
                - any-glob-to-any-file:
                  - '.github/**'
              - head-branch:
                - '^maintenance/'
                - '^ci/'
                - '^workflow/'
                - '^chore/'
        EOT
      + file                            = ".github/labeler.yml"
      + id                              = (known after apply)
      + overwrite_on_create             = true
      + ref                             = (known after apply)
      + repository                      = "dyson-rs"
      + sha                             = (known after apply)
    }

  # module.repositories["dyson-rs"].github_repository_file.this["github/pull_request_template.md"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "master"
      + autocreate_branch_source_sha    = (known after apply)
      + branch                          = "chore/managed-by-terraform"
      + commit_message                  = "Managed by Terraform: .github/pull_request_template.md"
      + commit_sha                      = (known after apply)
      + content                         = <<-EOT
            # Overview :rocket:
            > What is this pull request ?
            
            # Implementation :clamp:
            > How to realize ?
            
            # Use cases :chopsticks:
            > Why this pull request was created ?
            
            # Testing :gear:
            > Testing steps
            
            # Related :chains:
            > The list of related issues or pull requests
            
            # Remark :eyes:
            > Any remarks
        EOT
      + file                            = ".github/pull_request_template.md"
      + id                              = (known after apply)
      + overwrite_on_create             = true
      + ref                             = (known after apply)
      + repository                      = "dyson-rs"
      + sha                             = (known after apply)
    }

  # module.repositories["dyson-rs"].github_repository_file.this["github/release.yml"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "master"
      + autocreate_branch_source_sha    = (known after apply)
      + branch                          = "chore/managed-by-terraform"
      + commit_message                  = "Managed by Terraform: .github/release.yml"
      + commit_sha                      = (known after apply)
      + content                         = <<-EOT
            changelog:
              categories:
                - title: '🚀 Features'
                  labels:
                    - feature
                - title: '🔨 Breaking Changes'
                  labels:
                    - breaking
                - title: '🐛 Bug Fixes'
                  labels:
                    - bugfix
                - title: '🔧 Refactoring'
                  labels:
                    - refactor
                - title: '📖 Documentation'
                  labels:
                    - documentation
                - title: '👒 Dependency update'
                  labels:
                    - deps
                - title: '🧰 Maintenance'
                  labels:
                    - maintenance
                - title: Other Changes
                  labels:
                    - "*"
        EOT
      + file                            = ".github/release.yml"
      + id                              = (known after apply)
      + overwrite_on_create             = true
      + ref                             = (known after apply)
      + repository                      = "dyson-rs"
      + sha                             = (known after apply)
    }

  # module.repositories["dyson-rs"].github_repository_file.this["github/workflows/labeler.yml"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "master"
      + autocreate_branch_source_sha    = (known after apply)
      + branch                          = "chore/managed-by-terraform"
      + commit_message                  = "Managed by Terraform: .github/workflows/labeler.yml"
      + commit_sha                      = (known after apply)
      + content                         = <<-EOT
            name: Pull Request Labeler
            on:
            - pull_request_target
            
            jobs:
              labeler:
                permissions:
                  contents: read
                  pull-requests: write
                runs-on: ubuntu-latest
                steps:
                - uses: actions/labeler@v5
        EOT
      + file                            = ".github/workflows/labeler.yml"
      + id                              = (known after apply)
      + overwrite_on_create             = true
      + ref                             = (known after apply)
      + repository                      = "dyson-rs"
      + sha                             = (known after apply)
    }

  # module.repositories["dyson-rs"].github_repository_pull_request.managed will be created
  + resource "github_repository_pull_request" "managed" {
      + base_ref              = "master"
      + base_repository       = "dyson-rs"
      + base_sha              = (known after apply)
      + body                  = <<-EOT
            - .github/labeler.yml
            - .github/pull_request_template.md
            - .github/release.yml
            - .github/workflows/labeler.yml
        EOT
      + draft                 = (known after apply)
      + head_ref              = "chore/managed-by-terraform"
      + head_sha              = (known after apply)
      + id                    = (known after apply)
      + labels                = (known after apply)
      + maintainer_can_modify = false
      + number                = (known after apply)
      + opened_at             = (known after apply)
      + opened_by             = (known after apply)
      + state                 = (known after apply)
      + title                 = "[auto] snippet files managed by Terraform"
      + updated_at            = (known after apply)
    }

  # module.repositories["dyson-rs"].github_repository_ruleset.this will be created
  + resource "github_repository_ruleset" "this" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "default"
      + node_id     = (known after apply)
      + repository  = "dyson-rs"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + bypass_actors {
          + actor_id    = 5
          + actor_type  = "RepositoryRole"
          + bypass_mode = "pull_request"
        }

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "~DEFAULT_BRANCH",
                ]
            }
        }

      + rules {
          + creation                      = true
          + deletion                      = true
          + non_fast_forward              = true
          + update_allows_fetch_and_merge = false

          + pull_request {
              + dismiss_stale_reviews_on_push     = false
              + require_code_owner_review         = false
              + require_last_push_approval        = false
              + required_approving_review_count   = 0
              + required_review_thread_resolution = false
            }
        }
    }

Plan: 13 to add, 1 to change, 0 to destroy.
module.repositories["dyson-rs"].github_repository.this: Modifying... [id=dyson-rs]
module.repositories["dyson-rs"].github_repository.this: Modifications complete after 2s [id=dyson-rs]
module.repositories["dyson-rs"].github_issue_label.this["bugfix"]: Creating...
module.repositories["dyson-rs"].github_issue_label.this["feature"]: Creating...
module.repositories["dyson-rs"].github_repository_file.this["github/pull_request_template.md"]: Creating...
module.repositories["dyson-rs"].github_issue_label.this["documentation"]: Creating...
module.repositories["dyson-rs"].github_issue_label.this["breaking"]: Creating...
module.repositories["dyson-rs"].github_issue_label.this["deps"]: Creating...
module.repositories["dyson-rs"].github_issue_label.this["maintenance"]: Creating...
module.repositories["dyson-rs"].github_repository_file.this["github/labeler.yml"]: Creating...
module.repositories["dyson-rs"].github_repository_file.this["github/workflows/labeler.yml"]: Creating...
module.repositories["dyson-rs"].github_repository_ruleset.this: Creating...
module.repositories["dyson-rs"].github_repository_ruleset.this: Creation complete after 10s [id=2589508]
module.repositories["dyson-rs"].github_repository_file.this["github/release.yml"]: Creating...
module.repositories["dyson-rs"].github_issue_label.this["bugfix"]: Creation complete after 10s [id=dyson-rs:bugfix]
module.repositories["dyson-rs"].github_issue_label.this["feature"]: Still creating... [10s elapsed]
module.repositories["dyson-rs"].github_repository_file.this["github/pull_request_template.md"]: Still creating... [10s elapsed]
module.repositories["dyson-rs"].github_issue_label.this["refactor"]: Creating...
module.repositories["dyson-rs"].github_issue_label.this["documentation"]: Still creating... [10s elapsed]
module.repositories["dyson-rs"].github_issue_label.this["maintenance"]: Still creating... [10s elapsed]
module.repositories["dyson-rs"].github_issue_label.this["deps"]: Still creating... [10s elapsed]
module.repositories["dyson-rs"].github_issue_label.this["breaking"]: Still creating... [10s elapsed]
module.repositories["dyson-rs"].github_repository_file.this["github/workflows/labeler.yml"]: Still creating... [10s elapsed]
module.repositories["dyson-rs"].github_repository_file.this["github/labeler.yml"]: Still creating... [10s elapsed]
module.repositories["dyson-rs"].github_issue_label.this["feature"]: Creation complete after 10s [id=dyson-rs:feature]
module.repositories["dyson-rs"].github_issue_label.this["deps"]: Creation complete after 10s [id=dyson-rs:deps]
module.repositories["dyson-rs"].github_issue_label.this["maintenance"]: Creation complete after 11s [id=dyson-rs:maintenance]
module.repositories["dyson-rs"].github_issue_label.this["documentation"]: Creation complete after 12s [id=dyson-rs:documentation]
module.repositories["dyson-rs"].github_issue_label.this["breaking"]: Creation complete after 12s [id=dyson-rs:breaking]
module.repositories["dyson-rs"].github_issue_label.this["refactor"]: Creation complete after 9s [id=dyson-rs:refactor]
module.repositories["dyson-rs"].github_repository_file.this["github/release.yml"]: Still creating... [10s elapsed]
module.repositories["dyson-rs"].github_repository_file.this["github/pull_request_template.md"]: Still creating... [20s elapsed]
module.repositories["dyson-rs"].github_repository_file.this["github/pull_request_template.md"]: Creation complete after 20s [id=dyson-rs/.github/pull_request_template.md]
module.repositories["dyson-rs"].github_repository_file.this["github/release.yml"]: Creation complete after 10s [id=dyson-rs/.github/release.yml]

Error: POST https://api.github.com/repos/hayas1/dyson-rs/git/refs: 422 Reference already exists []

  with module.repositories["dyson-rs"].github_repository_file.this["github/labeler.yml"],
  on module/repository/files.tf line 12, in resource "github_repository_file" "this":
  12: resource "github_repository_file" "this" {


Error: POST https://api.github.com/repos/hayas1/dyson-rs/git/refs: 422 Reference already exists []

  with module.repositories["dyson-rs"].github_repository_file.this["github/workflows/labeler.yml"],
  on module/repository/files.tf line 12, in resource "github_repository_file" "this":
  12: resource "github_repository_file" "this" {

::error::Terraform exited with code 1.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":57,"Program":"tfcmt","SHA1":"8150f61bf5d62aeff025c77c3c712d6ac6dac26c","Vars":{},"WorkflowName":"Terraform apply on push"} -->